package com.igorini.togepibot.gui.keyword

/** Represents a keyword for text and sound associated with "Defeat" */
object DefeatKeyword : Keyword() {
    override fun folder() = "defeat"
    override fun voiceRus() = listOf("поражение", "поражения", "поражению", "поражением", "поражении", "проиграл", "проиграла", "проиграли", "проиграю", "проиграешь", "проиграет", "проиграем", "приграете", "проиграют", "проиграй", "проиграем", "проиграйте", "луз", "консид", "консидай", "консидни", "проигран", "проиграна", "проигрыш", "проигрыша", "проигрышу", "проигрышем", "проигрыше", "проигрыши", "проигрышей", "проигрышам", "проигрышами", "проигрышах", "проиграл", "проиграла", "проиграло", "проиграли", "проиграю", "проиграешь", "проиграет", "проиграем", "проиграете", "проиграют", "просрал", "всрал", "просрала", "всрала", "просру", "просрет", "всрет", "всру", "проиграй", "проиграем", "проиграете", "проиграйте", "проиграв", "проигравший", "проигравшего", "проигравшему", "проигравшим", "проигравшем", "проигравшая", "проигравшей", "проигравшую", "проигравшей", "проигравшие", "проигравших", "проигравшим", "проигравшими", "проигранный", "проигранная", "проигран", "проиграна", "проиграно", "проиграны")
    override fun voiceEng() = listOf("defeat")
    override fun textRus() = voiceRus()
    override fun textEng() = voiceEng()
    override fun emotes() = listOf("defeat")
}